class Transport:
    def __init__(self, швидкість, потужність):
        self.швидкість = швидкість
        self.потужність = потужність

    def прискорити(self, значення):
        self.швидкість += значення


class Автомобіль(Transport):
    def __init__(self, швидкість, потужність, пальне):
        super().__init__(швидкість, потужність)
        self.пальне = пальне


class Велосипед(Transport):
    def __init__(self, швидкість, потужність, кількість_педалей):
        super().__init__(швидкість, потужність)
        self.кількість_педалей = кількість_педалей


# Створення об'єктів для кожного підкласу
автомобіль = Автомобіль(100, 200, "бензин")
велосипед = Велосипед(30, 50, 2)

# Зміна атрибутів для об'єктів
автомобіль.прискорити(20)
велосипед.прискорити(10)

# Виведення значень атрибутів
print(f"Автомобіль: Швидкість - {автомобіль.швидкість}, Пальне - {автомобіль.пальне}")
print(f"Велосипед: Швидкість - {велосипед.швидкість}, Кількість педалей - {велосипед.кількість_педалей}")