
class ТранспортнийЗасіб:
    def __init__(self, швидкість, потужність):
        self.швидкість = швидкість
        self.потужність = потужність

    def прискорити(self, збільшення_швидкості):
        self.швидкість += збільшення_швидкості

class Автомобіль(ТранспортнийЗасіб):
    def __init__(self, швидкість, потужність, пальне):
        super().__init__(швидкість, потужність)
        self.пальне = пальне

class Велосипед(ТранспортнийЗасіб):
    def __init__(self, швидкість, потужність, кількість_педалей):
        super().__init__(швидкість, потужність)
        self.кількість_педалей = кількість_педалей

# Створення об'єктів для кожного підкласу
автомобіль = Автомобіль(100, 150, 'бензин')
велосипед = Велосипед(20, 10, 2)

# Зміна атрибутів і виклик методу "прискорити" для кожного об'єкта
автомобіль.прискорити(30)
велосипед.прискорити(10)

# Виведення значень атрибутів після змін
print(f'Автомобіль: швидкість = {автомобіль.швидкість}, пальне = {автомобіль.пальне}')
print(f'Велосипед: швидкість = {велосипед.швидкість}, кількість педалей = {велосипед.кількість_педалей}')





